### Acquire Data Exercises

In [1]:
import pandas as pd
import numpy as np
import os
import acquire
import prepare

# visualize
import seaborn as sns
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(11, 9))
plt.rc('font', size=13)

# acquire
from env import host, user, password
from pydataset import data

In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [2]:
iris_df = data('iris')

In [3]:
iris_df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
iris_df.shape

(150, 5)

In [5]:
iris_df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [6]:
iris_df.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [7]:
iris_df.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [8]:
df_excel = pd.read_excel('spreadsheet_exercises.xlsx')
df_excel.head(5)
# or
# df_excel.iloc[0:100]

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,has_churned,has_phone,has_internet,has_phone_and_internet,partner_dependents,start_date,avg_monthly_charges,contract_type.1,phone_service.1,internet_service.1
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,...,False,True,True,True,0,2020-08-10 13:46:58.656,65.6,1 Year,One Line,DSL
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,...,False,True,True,True,1,2021-01-17 09:42:13.248,59.9,Month-to-Month,Two or More Lines,DSL
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,...,True,True,True,True,1,2020-04-23 19:16:50.304,73.9,Month-to-Month,One Line,Fiber Optic
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,...,True,True,True,True,2,2021-02-05 01:23:48.480,98.0,Month-to-Month,One Line,Fiber Optic
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,...,True,True,True,True,1,2020-09-04 13:04:14.304,83.9,Month-to-Month,One Line,Fiber Optic

In [9]:
# df_excel.columns = df_excel.iloc[0]
# df_excel = df_excel.drop(df_excel.index[0])

In [10]:
df_excel_sample = df_excel.head(101)

In [11]:
# prints # of rows
df_excel.shape[0]

7049

In [12]:
# prints columns 1 through 5
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [13]:
df_excel.dtypes

customer_id                       object
gender                            object
is_senior_citizen                  int64
partner                           object
dependents                        object
phone_service                      int64
internet_service                   int64
contract_type                      int64
payment_type                      object
monthly_charges                  float64
total_charges                    float64
churn                             object
tenure                           float64
is_female                           bool
has_churned                         bool
has_phone                           bool
has_internet                        bool
has_phone_and_internet              bool
partner_dependents                 int64
start_date                datetime64[ns]
avg_monthly_charges              float64
contract_type.1                   object
phone_service.1                   object
internet_service.1                object
dtype: object

In [14]:
df_excel.select_dtypes(include='object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn', 'contract_type.1', 'phone_service.1', 'internet_service.1'],
      dtype='object')

In [15]:
df_excel.select_dtypes(include=['int','float']).columns

Index(['is_senior_citizen', 'phone_service', 'internet_service',
       'contract_type', 'monthly_charges', 'total_charges', 'tenure',
       'partner_dependents', 'avg_monthly_charges'],
      dtype='object')

In [16]:
# finding range of numerical columns
# first isolate my numerical columns
df_numerical = df_excel.select_dtypes(include=[np.number])
df_numerical

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges,tenure,partner_dependents,avg_monthly_charges
0,0,1,1,1,65.60,593.30,9.044207,0,65.60
1,0,2,1,0,59.90,542.40,9.055092,1,59.90
2,0,1,2,0,73.90,280.85,3.800406,1,73.90
3,1,1,2,0,98.00,1237.85,12.631122,2,98.00
4,1,1,2,0,83.90,267.40,3.187128,1,83.90
...,...,...,...,...,...,...,...,...,...
7044,0,1,1,1,55.15,742.90,13.470535,0,55.15
7045,0,2,2,0,85.10,1873.70,22.017626,3,85.10
7046,0,1,1,0,50.30,92.75,1.843936,3,50.30
7047,0,1,1,2,67.85,4627.65,68.204127,-1,67.85
7048,0,0,1,2,59.00,3707.60,62.840678,-1,59.00

In [17]:
df_numerical.max()-df_numerical.min()

is_senior_citizen         1.000000
phone_service             2.000000
internet_service          2.000000
contract_type             2.000000
monthly_charges         100.500000
total_charges          8666.000000
tenure                   79.341772
partner_dependents        4.000000
avg_monthly_charges     118.750000
dtype: float64

Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [18]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [19]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [20]:
df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [21]:
df_googlesheet.shape

(891, 12)

In [22]:
list(df_googlesheet.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [23]:
df_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [24]:
df_googlesheet.select_dtypes(include=[np.number]).describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [25]:
df_googlesheet.select_dtypes(include=[np.object]).nunique()

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

#### Exercises
The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

Using the Iris Data:

- Use the function defined in acquire.py to load the iris data.

- Drop the species_id and measurement_id columns.

- Rename the species_name column to just species.

- Create dummy variables of the species name.

- Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [26]:
# Use the function defined in acquire.py to load the iris data.
iris_df = acquire.get_iris_data()
iris_df.head(5)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [27]:
# Drop the species_id and measurement_id columns.

iris_df = iris_df.drop(columns=['species_id', 'measurement_id'])
iris_df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa

In [28]:
# Rename the species_name column to just species.
iris_df = iris_df.rename(columns={'species_name': 'species'})
iris_df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [29]:
# Create dummy variables of the species name.
dummy_df = pd.get_dummies(iris_df[['species']], dummy_na=False)
dummy_df.head(3)

   species_setosa  species_versicolor  species_virginica
0               1                   0                  0
1               1                   0                  0
2               1                   0                  0

In [30]:
# Create a function named prep_iris that accepts the untransformed iris data, 
# and returns the data with the transformations above applied.
def prep_iris(iris_df):
    iris_df = iris_df.drop(columns=['species_id', 'measurement_id'])
    iris_df = iris_df.rename(columns={'species_name': 'species'})
    dummy_df = pd.get_dummies(iris_df[['species']])
    iris_df = pd.concat([df, dummy_df], axis=1)
    return iris_df

In [31]:
# iris_df = prepare.prep_iris(iris_df)

#### Extra Practice
2.  Prepare Titanic Data - Challenge/Bonus Exercises
- 2.1  Use the function you defined in acquire.py to load the titanic dataset.
- 2.2  Handle the missing values in the embark_town and embarked columns.
- 2.3  Remove the deck column.
- 2.4  Create a dummy variable of the embarked column.
- 2.5  Split Data
- 2.5.1  Create a helper function to split titanic data into train, validate, test datasets
- 2.6  Fill or impute the missing values in age.
- 2.6.1  Build a helper function for imputing
- 2.7  Create a prep_titanic function that accepts the untransformed titanic data and returns the data with the transformations above applied.

In [32]:
# Use the function you defined in acquire.py to load the titanic dataset.
titanic_df = acquire.get_titanic_data()
titanic_df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

In [33]:
# see where our missing values are
missing = titanic_df.isnull().sum()
missing[missing > 0]

age            177
embarked         2
deck           688
embark_town      2
dtype: int64

In [34]:
# Handle the missing values in the embark_town and embarked columns.
titanic_df['embark_town'] = titanic_df.embark_town.fillna(value='Southampton')

In [35]:
titanic_df['embarked'] = titanic_df.embark_town.fillna(value='S')

In [36]:
# Remove the deck column.
titanic_df = titanic_df.drop(columns=['deck'])

In [37]:
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,Southampton,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,Cherbourg,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,Southampton,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,Southampton,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,Southampton,Third,Southampton,1